#define _CRT_SECURE_NO_WARNINGS 1

//1.把函数处理结果的两个数据返回给主调函数，下面方法不正确的是
//return这两个数 只能返回一个数 
//形参用数组
//形参用两个指针
//用两个全局变量

//2.关于函数调用说法不正确的是
//函数可以传址调用 传址调用的时候形参是实参的一个粉临时拷贝
//函数可以传址调用，传址调用的时候，可以通过形参操作实参
//函数可以嵌套定义，但不能嵌套调用
//函数可以嵌套调用，但不能嵌套定义

//3.在函数调用时，以下说法正确的是
//函数调用后必须带回返回值 可以无返回值void
//实际参数和形式参数可以同名
//函数间的数据传递不可以使用全局变量
//主调函数和被调函数总是在同一个文件中

//4.关于函数的声明和定义说法正确的是
//函数的定义必须放在函数的使用之前
//函数必须保证先声明后使用
//函数定义在使用之后，也可以不声明
//函数的声明就是说明函数是怎么实现的

//5.关于实参和形参描述错误的是
//形参是实参的一份临时拷贝
//形参是在函数调用的时候才实例化，才开辟内存空间
//改变形参就是改变实参
//函数调用如果采用传值调用，改变形参不影响实参

//6.函数调用exec（(v1,v2),(v3,v4),v5,v6)中，实参的个数是
//3
//4 逗号表达式
//5
//6

//7.一下关于函数设计不正确的说法是
//函数设计应该追求高内聚低耦合 个体尽量独立 个体间少联系（功能不重复）
//要尽可能多的使用全局变量
//函数参数不易过多
//设计函数时，尽量做到谁申请的资源就由谁来释放

//8.关于C语言函数描述正确的是
//函数必须有参数和返回值
//函数的实参只能是变量
//库函数的使用必须要包含对应的头文件
//有了库函数就不需要自定义函数了

//9.C语言规定，在一个源程序中 main函数的位置可以任意

//10.以下叙述不正确的是
//不同函数中可以使用相同名字变量
//函数中的形式参数实在栈中保存
//一个函数内定义的变量旨在本函数范围内有效
//一个函数内复合语句中定义的变量在本函数范围内有效
//（复合语句指函数中的成对括号构成的代码）

//a c b b c b b c {} d


